dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
# NiusBurner mcs51 boards.
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0
#
# Generated from niusburner/boards.json by `python -m niusburner setup`.
# Edit the catalog, not this file.
#
# Defaults are the safe answer, not the fastest one: Size, because
# these parts run out of room long before cycles;
# because symbols cost build time and disk rather than flash; and
# auto-detection, because a compiler is normally where its own
# installer put it.

menu.optimize=Optimize
menu.reset=Power switch
menu.entry=Bootloader entry
menu.compiler=Compiler

# ----------------------------------------------------------------------
# 2 KB flash. No ISP: 12 V parallel programmer on a Nano. compile works; upload is not yet wired. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89c2051.name=AT89C2051 (2 KB, compile only) [experimental]
at89c2051.upload.tool=niusburner
at89c2051.upload.protocol=nano_at89c2051
at89c2051.upload.maximum_size=2048
at89c2051.upload.maximum_data_size=128
at89c2051.upload.require_upload_port=false
at89c2051.build.mcu=at89c2051
at89c2051.build.f_cpu=11059200L
at89c2051.build.board=AT89C2051
at89c2051.build.core=niusburner
at89c2051.build.variant=standard
at89c2051.build.nb_board=at89c2051
at89c2051.build.extra_flags=

at89c2051.menu.optimize.size=Size (default)
at89c2051.menu.optimize.size.build.nb_optimize=size
at89c2051.menu.optimize.speed=Speed
at89c2051.menu.optimize.speed.build.nb_optimize=speed
at89c2051.menu.optimize.none=None
at89c2051.menu.optimize.none.build.nb_optimize=none

at89c2051.menu.compiler.auto=Auto-detect SDCC (default)
at89c2051.menu.compiler.auto.build.nb_compiler=auto
at89c2051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c2051.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89c51.name=AT89C51 (4 KB, compile only) [experimental]
at89c51.upload.tool=niusburner
at89c51.upload.protocol=parallel_hv
at89c51.upload.maximum_size=4096
at89c51.upload.maximum_data_size=128
at89c51.upload.require_upload_port=false
at89c51.build.mcu=at89c51
at89c51.build.f_cpu=11059200L
at89c51.build.board=AT89C51
at89c51.build.core=niusburner
at89c51.build.variant=standard
at89c51.build.nb_board=at89c51
at89c51.build.extra_flags=

at89c51.menu.optimize.size=Size (default)
at89c51.menu.optimize.size.build.nb_optimize=size
at89c51.menu.optimize.speed=Speed
at89c51.menu.optimize.speed.build.nb_optimize=speed
at89c51.menu.optimize.none=None
at89c51.menu.optimize.none.build.nb_optimize=none

at89c51.menu.compiler.auto=Auto-detect SDCC (default)
at89c51.menu.compiler.auto.build.nb_compiler=auto
at89c51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c51.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
at89c52.name=AT89C52 (8 KB, compile only) [experimental]
at89c52.upload.tool=niusburner
at89c52.upload.protocol=parallel_hv
at89c52.upload.maximum_size=8192
at89c52.upload.maximum_data_size=256
at89c52.upload.require_upload_port=false
at89c52.build.mcu=at89c52
at89c52.build.f_cpu=11059200L
at89c52.build.board=AT89C52
at89c52.build.core=niusburner
at89c52.build.variant=standard
at89c52.build.nb_board=at89c52
at89c52.build.extra_flags=

at89c52.menu.optimize.size=Size (default)
at89c52.menu.optimize.size.build.nb_optimize=size
at89c52.menu.optimize.speed=Speed
at89c52.menu.optimize.speed.build.nb_optimize=speed
at89c52.menu.optimize.none=None
at89c52.menu.optimize.none.build.nb_optimize=none

at89c52.menu.compiler.auto=Auto-detect SDCC (default)
at89c52.menu.compiler.auto.build.nb_compiler=auto
at89c52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c52.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 20 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
at89c55.name=AT89C55 (20 KB, compile only) [experimental]
at89c55.upload.tool=niusburner
at89c55.upload.protocol=parallel_hv
at89c55.upload.maximum_size=20480
at89c55.upload.maximum_data_size=256
at89c55.upload.require_upload_port=false
at89c55.build.mcu=at89c55
at89c55.build.f_cpu=11059200L
at89c55.build.board=AT89C55
at89c55.build.core=niusburner
at89c55.build.variant=standard
at89c55.build.nb_board=at89c55
at89c55.build.extra_flags=

at89c55.menu.optimize.size=Size (default)
at89c55.menu.optimize.size.build.nb_optimize=size
at89c55.menu.optimize.speed=Speed
at89c55.menu.optimize.speed.build.nb_optimize=speed
at89c55.menu.optimize.none=None
at89c55.menu.optimize.none.build.nb_optimize=none

at89c55.menu.compiler.auto=Auto-detect SDCC (default)
at89c55.menu.compiler.auto.build.nb_compiler=auto
at89c55.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89c55.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 2 KB flash, 20-pin. Serial ISP like the rest of the AT89S family. Only P1 and P3 are bonded out, so most pin numbers address ports this package does not have. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s2051.name=AT89S2051 (2 KB, USB-ISP) [experimental]
at89s2051.upload.tool=niusburner
at89s2051.upload.protocol=usbisp_hid
at89s2051.upload.maximum_size=2048
at89s2051.upload.maximum_data_size=128
at89s2051.upload.require_upload_port=false
at89s2051.build.mcu=at89s2051
at89s2051.build.f_cpu=11059200L
at89s2051.build.board=AT89S2051
at89s2051.build.core=niusburner
at89s2051.build.variant=standard
at89s2051.build.nb_board=at89s2051
at89s2051.build.extra_flags=

at89s2051.menu.optimize.size=Size (default)
at89s2051.menu.optimize.size.build.nb_optimize=size
at89s2051.menu.optimize.speed=Speed
at89s2051.menu.optimize.speed.build.nb_optimize=speed
at89s2051.menu.optimize.none=None
at89s2051.menu.optimize.none.build.nb_optimize=none

at89s2051.menu.compiler.auto=Auto-detect SDCC (default)
at89s2051.menu.compiler.auto.build.nb_compiler=auto
at89s2051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s2051.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash, 20-pin. Serial ISP like the rest of the AT89S family. Only P1 and P3 are bonded out, so most pin numbers address ports this package does not have. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s4051.name=AT89S4051 (4 KB, USB-ISP) [experimental]
at89s4051.upload.tool=niusburner
at89s4051.upload.protocol=usbisp_hid
at89s4051.upload.maximum_size=4096
at89s4051.upload.maximum_data_size=128
at89s4051.upload.require_upload_port=false
at89s4051.build.mcu=at89s4051
at89s4051.build.f_cpu=11059200L
at89s4051.build.board=AT89S4051
at89s4051.build.core=niusburner
at89s4051.build.variant=standard
at89s4051.build.nb_board=at89s4051
at89s4051.build.extra_flags=

at89s4051.menu.optimize.size=Size (default)
at89s4051.menu.optimize.size.build.nb_optimize=size
at89s4051.menu.optimize.speed=Speed
at89s4051.menu.optimize.speed.build.nb_optimize=speed
at89s4051.menu.optimize.none=None
at89s4051.menu.optimize.none.build.nb_optimize=none

at89s4051.menu.compiler.auto=Auto-detect SDCC (default)
at89s4051.menu.compiler.auto.build.nb_compiler=auto
at89s4051.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s4051.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash. Same USB-ISP HID route as AT89S52. No Timer 2, so Serial tops out at 57600 rather than 115200.
at89s51.name=AT89S51 (4 KB, USB-ISP)
at89s51.upload.tool=niusburner
at89s51.upload.protocol=usbisp_hid
at89s51.upload.maximum_size=4096
at89s51.upload.maximum_data_size=128
at89s51.upload.require_upload_port=false
at89s51.build.mcu=at89s51
at89s51.build.f_cpu=11059200L
at89s51.build.board=AT89S51
at89s51.build.core=niusburner
at89s51.build.variant=standard
at89s51.build.nb_board=at89s51
at89s51.build.extra_flags=

at89s51.menu.optimize.size=Size (default)
at89s51.menu.optimize.size.build.nb_optimize=size
at89s51.menu.optimize.speed=Speed
at89s51.menu.optimize.speed.build.nb_optimize=speed
at89s51.menu.optimize.none=None
at89s51.menu.optimize.none.build.nb_optimize=none

at89s51.menu.compiler.auto=Auto-detect SDCC (default)
at89s51.menu.compiler.auto.build.nb_compiler=auto
at89s51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s51.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 KB flash, 256 IRAM, no XRAM on a minimum DIP-40. USB-ISP HID. Segment/TM1637 sketches fit; colour graphics need external SRAM.
at89s52.name=AT89S52 (8 KB, USB-ISP)
at89s52.upload.tool=niusburner
at89s52.upload.protocol=usbisp_hid
at89s52.upload.maximum_size=8192
at89s52.upload.maximum_data_size=256
at89s52.upload.require_upload_port=false
at89s52.build.mcu=at89s52
at89s52.build.f_cpu=11059200L
at89s52.build.board=AT89S52
at89s52.build.core=niusburner
at89s52.build.variant=standard
at89s52.build.nb_board=at89s52
at89s52.build.extra_flags=

at89s52.menu.optimize.size=Size (default)
at89s52.menu.optimize.size.build.nb_optimize=size
at89s52.menu.optimize.speed=Speed
at89s52.menu.optimize.speed.build.nb_optimize=speed
at89s52.menu.optimize.none=None
at89s52.menu.optimize.none.build.nb_optimize=none

at89s52.menu.compiler.auto=Auto-detect SDCC (default)
at89s52.menu.compiler.auto.build.nb_compiler=auto
at89s52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s52.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 12 KB flash. Same USB-ISP HID route and the same serial-ISP protocol as the AT89S52.
at89s53.name=AT89S53 (12 KB, USB-ISP)
at89s53.upload.tool=niusburner
at89s53.upload.protocol=usbisp_hid
at89s53.upload.maximum_size=12288
at89s53.upload.maximum_data_size=256
at89s53.upload.require_upload_port=false
at89s53.build.mcu=at89s53
at89s53.build.f_cpu=11059200L
at89s53.build.board=AT89S53
at89s53.build.core=niusburner
at89s53.build.variant=standard
at89s53.build.nb_board=at89s53
at89s53.build.extra_flags=

at89s53.menu.optimize.size=Size (default)
at89s53.menu.optimize.size.build.nb_optimize=size
at89s53.menu.optimize.speed=Speed
at89s53.menu.optimize.speed.build.nb_optimize=speed
at89s53.menu.optimize.none=None
at89s53.menu.optimize.none.build.nb_optimize=none

at89s53.menu.compiler.auto=Auto-detect SDCC (default)
at89s53.menu.compiler.auto.build.nb_compiler=auto
at89s53.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s53.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 KB flash plus 2 KB EEPROM. Same serial-ISP protocol; the EEPROM is not written by this tool.
at89s8252.name=AT89S8252 (8 KB, USB-ISP) [experimental]
at89s8252.upload.tool=niusburner
at89s8252.upload.protocol=usbisp_hid
at89s8252.upload.maximum_size=8192
at89s8252.upload.maximum_data_size=256
at89s8252.upload.require_upload_port=false
at89s8252.build.mcu=at89s8252
at89s8252.build.f_cpu=11059200L
at89s8252.build.board=AT89S8252
at89s8252.build.core=niusburner
at89s8252.build.variant=standard
at89s8252.build.nb_board=at89s8252
at89s8252.build.extra_flags=

