dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc15w408as.menu.optimize.size=Size (default)
stc15w408as.menu.optimize.size.build.nb_optimize=size
stc15w408as.menu.optimize.speed=Speed
stc15w408as.menu.optimize.speed.build.nb_optimize=speed
stc15w408as.menu.optimize.none=None
stc15w408as.menu.optimize.none.build.nb_optimize=none

stc15w408as.menu.reset.none=None - interrupt power by hand (default)
stc15w408as.menu.reset.none.build.nb_reset=none
stc15w408as.menu.reset.dtr=Adapter DTR switches VDD
stc15w408as.menu.reset.dtr.build.nb_reset=dtr
stc15w408as.menu.reset.rts=Adapter RTS switches VDD
stc15w408as.menu.reset.rts.build.nb_reset=rts

stc15w408as.menu.entry.none=Interrupt power by hand (default)
stc15w408as.menu.entry.none.build.nb_entry=none
stc15w408as.menu.entry.soft=Sketch reboots itself into the bootloader
stc15w408as.menu.entry.soft.build.nb_entry=soft

stc15w408as.menu.compiler.auto=Auto-detect SDCC (default)
stc15w408as.menu.compiler.auto.build.nb_compiler=auto
stc15w408as.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc15w408as.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash. Same UART bootloader as the STC89C52RC.
stc89c51rc.name=STC89C51RC (4 KB, serial bootloader)
stc89c51rc.upload.tool=niusburner
stc89c51rc.upload.protocol=stcgal
stc89c51rc.upload.maximum_size=4096
stc89c51rc.upload.maximum_data_size=256
stc89c51rc.upload.require_upload_port=true
stc89c51rc.build.mcu=stc89c51rc
stc89c51rc.build.f_cpu=11059200L
stc89c51rc.build.board=STC89C51RC
stc89c51rc.build.core=niusburner
stc89c51rc.build.variant=standard
stc89c51rc.build.nb_board=stc89c51rc
stc89c51rc.build.extra_flags=

stc89c51rc.menu.optimize.size=Size (default)
stc89c51rc.menu.optimize.size.build.nb_optimize=size
stc89c51rc.menu.optimize.speed=Speed
stc89c51rc.menu.optimize.speed.build.nb_optimize=speed
stc89c51rc.menu.optimize.none=None
stc89c51rc.menu.optimize.none.build.nb_optimize=none

stc89c51rc.menu.reset.none=None - interrupt power by hand (default)
stc89c51rc.menu.reset.none.build.nb_reset=none
stc89c51rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c51rc.menu.reset.dtr.build.nb_reset=dtr
stc89c51rc.menu.reset.rts=Adapter RTS switches VDD
stc89c51rc.menu.reset.rts.build.nb_reset=rts

stc89c51rc.menu.entry.none=Interrupt power by hand (default)
stc89c51rc.menu.entry.none.build.nb_entry=none
stc89c51rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c51rc.menu.entry.soft.build.nb_entry=soft

stc89c51rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c51rc.menu.compiler.auto.build.nb_compiler=auto
stc89c51rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c51rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# UART bootloader (stcgal) on the serial adapter, not the ISP header. Entry is power-on only, so the board needs a supply that can be interrupted. Reports 8 KB code flash and a 12-clock machine cycle, so the AT89S52 timing carries over.
stc89c52rc.name=STC89C52RC (8 KB, serial bootloader)
stc89c52rc.upload.tool=niusburner
stc89c52rc.upload.protocol=stcgal
stc89c52rc.upload.maximum_size=8192
stc89c52rc.upload.maximum_data_size=256
stc89c52rc.upload.require_upload_port=true
stc89c52rc.build.mcu=stc89c52rc
stc89c52rc.build.f_cpu=11059200L
stc89c52rc.build.board=STC89C52RC
stc89c52rc.build.core=niusburner
stc89c52rc.build.variant=standard
stc89c52rc.build.nb_board=stc89c52rc
stc89c52rc.build.extra_flags=

stc89c52rc.menu.optimize.size=Size (default)
stc89c52rc.menu.optimize.size.build.nb_optimize=size
stc89c52rc.menu.optimize.speed=Speed
stc89c52rc.menu.optimize.speed.build.nb_optimize=speed
stc89c52rc.menu.optimize.none=None
stc89c52rc.menu.optimize.none.build.nb_optimize=none

stc89c52rc.menu.reset.none=None - interrupt power by hand (default)
stc89c52rc.menu.reset.none.build.nb_reset=none
stc89c52rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c52rc.menu.reset.dtr.build.nb_reset=dtr
stc89c52rc.menu.reset.rts=Adapter RTS switches VDD
stc89c52rc.menu.reset.rts.build.nb_reset=rts

stc89c52rc.menu.entry.none=Interrupt power by hand (default)
stc89c52rc.menu.entry.none.build.nb_entry=none
stc89c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c52rc.menu.entry.soft.build.nb_entry=soft

stc89c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c52rc.menu.compiler.auto.build.nb_compiler=auto
stc89c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c52rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 12 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c53rc.name=STC89C53RC (12 KB, serial bootloader) [experimental]
stc89c53rc.upload.tool=niusburner
stc89c53rc.upload.protocol=stcgal
stc89c53rc.upload.maximum_size=12288
stc89c53rc.upload.maximum_data_size=256
stc89c53rc.upload.require_upload_port=true
stc89c53rc.build.mcu=stc89c53rc
stc89c53rc.build.f_cpu=11059200L
stc89c53rc.build.board=STC89C53RC
stc89c53rc.build.core=niusburner
stc89c53rc.build.variant=standard
stc89c53rc.build.nb_board=stc89c53rc
stc89c53rc.build.extra_flags=

stc89c53rc.menu.optimize.size=Size (default)
stc89c53rc.menu.optimize.size.build.nb_optimize=size
stc89c53rc.menu.optimize.speed=Speed
stc89c53rc.menu.optimize.speed.build.nb_optimize=speed
stc89c53rc.menu.optimize.none=None
stc89c53rc.menu.optimize.none.build.nb_optimize=none

stc89c53rc.menu.reset.none=None - interrupt power by hand (default)
stc89c53rc.menu.reset.none.build.nb_reset=none
stc89c53rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c53rc.menu.reset.dtr.build.nb_reset=dtr
stc89c53rc.menu.reset.rts=Adapter RTS switches VDD
stc89c53rc.menu.reset.rts.build.nb_reset=rts

stc89c53rc.menu.entry.none=Interrupt power by hand (default)
stc89c53rc.menu.entry.none.build.nb_entry=none
stc89c53rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c53rc.menu.entry.soft.build.nb_entry=soft

stc89c53rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c53rc.menu.compiler.auto.build.nb_compiler=auto
stc89c53rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c53rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 16 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c54rd.name=STC89C54RD (16 KB, serial bootloader) [experimental]
stc89c54rd.upload.tool=niusburner
stc89c54rd.upload.protocol=stcgal
stc89c54rd.upload.maximum_size=16384
stc89c54rd.upload.maximum_data_size=256
stc89c54rd.upload.require_upload_port=true
stc89c54rd.build.mcu=stc89c54rd
stc89c54rd.build.f_cpu=11059200L
stc89c54rd.build.board=STC89C54RD
stc89c54rd.build.core=niusburner
stc89c54rd.build.variant=standard
stc89c54rd.build.nb_board=stc89c54rd
stc89c54rd.build.extra_flags=

