dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc89c54rd.menu.optimize.size=Size (default)
stc89c54rd.menu.optimize.size.build.nb_optimize=size
stc89c54rd.menu.optimize.speed=Speed
stc89c54rd.menu.optimize.speed.build.nb_optimize=speed
stc89c54rd.menu.optimize.none=None
stc89c54rd.menu.optimize.none.build.nb_optimize=none

stc89c54rd.menu.reset.none=None - interrupt power by hand (default)
stc89c54rd.menu.reset.none.build.nb_reset=none
stc89c54rd.menu.reset.dtr=Adapter DTR switches VDD
stc89c54rd.menu.reset.dtr.build.nb_reset=dtr
stc89c54rd.menu.reset.rts=Adapter RTS switches VDD
stc89c54rd.menu.reset.rts.build.nb_reset=rts

stc89c54rd.menu.entry.none=Interrupt power by hand (default)
stc89c54rd.menu.entry.none.build.nb_entry=none
stc89c54rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c54rd.menu.entry.soft.build.nb_entry=soft

stc89c54rd.menu.compiler.auto=Auto-detect SDCC (default)
stc89c54rd.menu.compiler.auto.build.nb_compiler=auto
stc89c54rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c54rd.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 32 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c58rd.name=STC89C58RD (32 KB, serial bootloader) [experimental]
stc89c58rd.upload.tool=niusburner
stc89c58rd.upload.protocol=stcgal
stc89c58rd.upload.maximum_size=32768
stc89c58rd.upload.maximum_data_size=256
stc89c58rd.upload.require_upload_port=true
stc89c58rd.build.mcu=stc89c58rd
stc89c58rd.build.f_cpu=11059200L
stc89c58rd.build.board=STC89C58RD
stc89c58rd.build.core=niusburner
stc89c58rd.build.variant=standard
stc89c58rd.build.nb_board=stc89c58rd
stc89c58rd.build.extra_flags=

stc89c58rd.menu.optimize.size=Size (default)
stc89c58rd.menu.optimize.size.build.nb_optimize=size
stc89c58rd.menu.optimize.speed=Speed
stc89c58rd.menu.optimize.speed.build.nb_optimize=speed
stc89c58rd.menu.optimize.none=None
stc89c58rd.menu.optimize.none.build.nb_optimize=none

stc89c58rd.menu.reset.none=None - interrupt power by hand (default)
stc89c58rd.menu.reset.none.build.nb_reset=none
stc89c58rd.menu.reset.dtr=Adapter DTR switches VDD
stc89c58rd.menu.reset.dtr.build.nb_reset=dtr
stc89c58rd.menu.reset.rts=Adapter RTS switches VDD
stc89c58rd.menu.reset.rts.build.nb_reset=rts

stc89c58rd.menu.entry.none=Interrupt power by hand (default)
stc89c58rd.menu.entry.none.build.nb_entry=none
stc89c58rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c58rd.menu.entry.soft.build.nb_entry=soft

stc89c58rd.menu.compiler.auto=Auto-detect SDCC (default)
stc89c58rd.menu.compiler.auto.build.nb_compiler=auto
stc89c58rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c58rd.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc90c51rc.name=STC90C51RC (4 KB, serial bootloader) [experimental]
stc90c51rc.upload.tool=niusburner
stc90c51rc.upload.protocol=stcgal
stc90c51rc.upload.maximum_size=4096
stc90c51rc.upload.maximum_data_size=256
stc90c51rc.upload.require_upload_port=true
stc90c51rc.build.mcu=stc90c51rc
stc90c51rc.build.f_cpu=11059200L
stc90c51rc.build.board=STC90C51RC
stc90c51rc.build.core=niusburner
stc90c51rc.build.variant=standard
stc90c51rc.build.nb_board=stc90c51rc
stc90c51rc.build.extra_flags=

stc90c51rc.menu.optimize.size=Size (default)
stc90c51rc.menu.optimize.size.build.nb_optimize=size
stc90c51rc.menu.optimize.speed=Speed
stc90c51rc.menu.optimize.speed.build.nb_optimize=speed
stc90c51rc.menu.optimize.none=None
stc90c51rc.menu.optimize.none.build.nb_optimize=none

stc90c51rc.menu.reset.none=None - interrupt power by hand (default)
stc90c51rc.menu.reset.none.build.nb_reset=none
stc90c51rc.menu.reset.dtr=Adapter DTR switches VDD
stc90c51rc.menu.reset.dtr.build.nb_reset=dtr
stc90c51rc.menu.reset.rts=Adapter RTS switches VDD
stc90c51rc.menu.reset.rts.build.nb_reset=rts

stc90c51rc.menu.entry.none=Interrupt power by hand (default)
stc90c51rc.menu.entry.none.build.nb_entry=none
stc90c51rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c51rc.menu.entry.soft.build.nb_entry=soft

stc90c51rc.menu.compiler.auto=Auto-detect SDCC (default)
stc90c51rc.menu.compiler.auto.build.nb_compiler=auto
stc90c51rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c51rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 KB flash. Same STC89-generation bootloader.
stc90c52rc.name=STC90C52RC (8 KB, serial bootloader)
stc90c52rc.upload.tool=niusburner
stc90c52rc.upload.protocol=stcgal
stc90c52rc.upload.maximum_size=8192
stc90c52rc.upload.maximum_data_size=256
stc90c52rc.upload.require_upload_port=true
stc90c52rc.build.mcu=stc90c52rc
stc90c52rc.build.f_cpu=11059200L
stc90c52rc.build.board=STC90C52RC
stc90c52rc.build.core=niusburner
stc90c52rc.build.variant=standard
stc90c52rc.build.nb_board=stc90c52rc
stc90c52rc.build.extra_flags=

stc90c52rc.menu.optimize.size=Size (default)
stc90c52rc.menu.optimize.size.build.nb_optimize=size
stc90c52rc.menu.optimize.speed=Speed
stc90c52rc.menu.optimize.speed.build.nb_optimize=speed
stc90c52rc.menu.optimize.none=None
stc90c52rc.menu.optimize.none.build.nb_optimize=none

stc90c52rc.menu.reset.none=None - interrupt power by hand (default)
stc90c52rc.menu.reset.none.build.nb_reset=none
stc90c52rc.menu.reset.dtr=Adapter DTR switches VDD
stc90c52rc.menu.reset.dtr.build.nb_reset=dtr
stc90c52rc.menu.reset.rts=Adapter RTS switches VDD
stc90c52rc.menu.reset.rts.build.nb_reset=rts

stc90c52rc.menu.entry.none=Interrupt power by hand (default)
stc90c52rc.menu.entry.none.build.nb_entry=none
stc90c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c52rc.menu.entry.soft.build.nb_entry=soft

stc90c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc90c52rc.menu.compiler.auto.build.nb_compiler=auto
stc90c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c52rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 32 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc90c58rd.name=STC90C58RD (32 KB, serial bootloader) [experimental]
stc90c58rd.upload.tool=niusburner
stc90c58rd.upload.protocol=stcgal
stc90c58rd.upload.maximum_size=32768
stc90c58rd.upload.maximum_data_size=256
stc90c58rd.upload.require_upload_port=true
stc90c58rd.build.mcu=stc90c58rd
stc90c58rd.build.f_cpu=11059200L
stc90c58rd.build.board=STC90C58RD
stc90c58rd.build.core=niusburner
stc90c58rd.build.variant=standard
stc90c58rd.build.nb_board=stc90c58rd
stc90c58rd.build.extra_flags=

